OpenAtomFoundation/TobudOS/board/BearPi_STM32L431RC/KEIL/micropython_basic_demo/board/mpconfigboard.h
/* board specific config */
#define MICROPY_HW_BOARD_NAME                       "BearPi"
#define MICROPY_HW_MCU_NAME                         "STM32F431RC"

#define MICROPY_HW_UART_NUM                         4
#define MICROPY_HW_UART_REPL                        2
#define MICROPY_HW_SPI_NUM                          4

/* project specific config */
#define MICROPY_CONFIG_ROM_LEVEL                    (MICROPY_CONFIG_ROM_LEVEL_BASIC_FEATURES)
